-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 24, 2024 at 12:30 PM
-- Server version: 10.4.25-MariaDB
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `app_quiz`
--

--
-- Dumping data for table `app_quiz_questions`
--

INSERT INTO `app_quiz_questions` (`id`, `class_id`, `subject_id`, `term_id`, `unit_id`, `section_id`, `question`, `position`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 1, 1, 1, 'اتخذ أول ملوك العصر العتيق عاصمة لمصر الموحدة هي مدينة؟', 0, '2024-12-22 15:44:09', '2024-12-24 11:29:42'),
(2, 1, 1, 1, 1, 1, 'سمي عصر الدولة القديمة باسم عصر ؟', 0, '2024-12-22 16:08:48', '2024-12-24 11:29:42'),
(4, 1, 1, 1, 1, 1, 'ثاني ملوك الأسرة ال  4 في مصر القديمة هو الملك ؟', 0, '2024-12-22 16:10:18', '2024-12-24 11:29:42'),
(6, 1, 1, 1, 1, 1, 'اهتم الفنانون بمصر في عصر الدولة القديمة بنحت تماثيل النبلاء مثل تمثال؟', 0, '2024-12-23 16:13:51', '2024-12-24 11:29:42'),
(7, 1, 1, 1, 1, 1, 'صاحب الهرم الاوسط هو الملك؟', 0, '2024-12-23 16:15:05', '2024-12-24 11:29:42'),
(8, 1, 1, 1, 1, 1, 'أمر الملك خفرع بنحت تمثال؟', 0, '2024-12-23 16:18:38', '2024-12-24 11:29:42'),
(9, 1, 1, 1, 1, 1, 'تأسست األسرة الـخامسة علي يد ا لملك؟.', 0, '2024-12-23 16:23:02', '2024-12-24 11:29:42'),
(12, 1, 1, 1, 1, 1, 'انتشرت بعض المعبودات المصرية في افريقيا مثل الصقر وخاصة في دولة؟', 0, '2024-12-24 08:12:14', '2024-12-24 11:29:42'),
(13, 1, 1, 1, 1, 1, 'بدأ مجد األسرة الـ 11 في مصر القديمة علي يد الملك؟', 0, '2024-12-24 08:14:47', '2024-12-24 11:29:42'),
(14, 1, 1, 1, 1, 1, 'نقل الملك أمنمحات الاول عاصمة الدولة من طيبة إلي ؟', 0, '2024-12-24 08:17:14', '2024-12-24 11:29:42'),
(15, 1, 1, 1, 1, 1, 'أسس الملك أمنمحات الاول سلسلة حصون علي الحدود الغربية للدلتا للحماية من؟', 0, '2024-12-24 08:17:59', '2024-12-24 11:29:42'),
(16, 1, 1, 1, 1, 1, 'تم انشاء قلعتي سمنة وقمنه علي يد الملك؟', 0, '2024-12-24 08:18:31', '2024-12-24 11:29:42'),
(17, 1, 1, 1, 1, 1, 'أنشاء الملك امنمحات الثالث سد ؟', 0, '2024-12-24 08:18:58', '2024-12-24 11:29:42'),
(18, 1, 1, 1, 1, 1, 'إحدي ملكات عصر الدولة الوسطي تولت حكم مصر عقب وفاه أمنمحات الرابع الملكة ؟', 0, '2024-12-24 08:19:33', '2024-12-24 11:29:42'),
(19, 1, 1, 1, 1, 1, 'المدينة التي اتخذها الهكسوس عاصمة لهم في مصر هي؟', 0, '2024-12-24 08:21:46', '2024-12-24 11:29:42'),
(20, 1, 1, 1, 1, 1, 'سعي الملك كامس لقطع االمدادات التي تصل الهكسوس من حاكم؟', 0, '2024-12-24 08:22:22', '2024-12-24 11:29:42'),
(21, 1, 1, 1, 1, 1, 'اهتمت الملكة حتشبسوت بإرسال رحالت تجارية لبلاد؟', 0, '2024-12-24 08:23:22', '2024-12-24 11:29:42'),
(22, 1, 1, 1, 1, 1, 'تأسس عصر الدولة الحديثة بمصر القديمة علي يد الملك..؟', 0, '2024-12-24 08:25:05', '2024-12-24 11:29:42'),
(23, 1, 1, 1, 1, 1, 'عمل الملك تحتمس األول علي تطوير معبد.؟', 0, '2024-12-24 08:26:25', '2024-12-24 11:29:42'),
(24, 1, 1, 1, 1, 1, 'أرسل الملك تحتمس الثالث أكبر عدد من الحملات العسكرية إلي قارة؟', 0, '2024-12-24 08:27:08', '2024-12-24 11:29:42'),
(25, 1, 1, 1, 1, 1, 'تولي الملك توت عنخ آمون حكم مصر خلفاً للملك؟', 0, '2024-12-24 08:27:44', '2024-12-24 11:29:42'),
(26, 1, 1, 1, 1, 1, 'يمكن أن يطلق علية رجل الحرب والسلام الملك.؟', 0, '2024-12-24 08:28:42', '2024-12-24 11:29:42'),
(27, 1, 1, 1, 1, 1, 'من أشهر المعارك التي خاضها الملك تحتمس الثالث معركة؟', 0, '2024-12-24 08:29:30', '2024-12-24 11:29:42'),
(28, 1, 1, 1, 1, 1, 'بدء ظهور الضعف في الدولة الحدثة بمصر القديمة بعد انتهاء حكم الملك.؟', 0, '2024-12-24 08:30:04', '2024-12-24 11:29:42'),
(29, 1, 1, 1, 1, 1, 'من الحيوانات التي تعيش في نظم الغابات المدارية المطيرة؟', 0, '2024-12-24 08:30:53', '2024-12-24 11:29:42'),
(30, 1, 1, 1, 1, 1, 'تتميز تربة الغابات المطيرة باللون؟', 0, '2024-12-24 08:31:31', '2024-12-24 11:29:42'),
(31, 1, 1, 1, 1, 1, 'يمتد نظم غابات                     بين دائرتي عرض 30 ، 45 شماالً وجنوباً في السواحل؟', 0, '2024-12-24 08:32:23', '2024-12-24 11:29:42'),
(32, 1, 1, 1, 1, 1, 'تعتبر الاغنام من الحيوانات التي تعيش في نظم غابات؟', 0, '2024-12-24 08:32:49', '2024-12-24 11:29:42'),
(33, 1, 1, 1, 1, 2, 'تعتبر الاسرة الـ 3 و 4 عصر البناء والتأسيس بمصر القديمة الاولي والثانية', 0, '2024-12-24 08:33:36', '2024-12-24 11:30:11'),
(34, 1, 1, 1, 1, 2, 'قسم المؤرخون تاريخ مصر إلي عصور تاريخية تمتاز جميعها بالقوة بها مراحل ضعف؟', 0, '2024-12-24 08:34:41', '2024-12-24 11:30:11'),
(35, 1, 1, 1, 1, 2, 'اهتم ملوك العصر العتيق بفنون العمارة؟', 0, '2024-12-24 08:51:16', '2024-12-24 11:30:11'),
(36, 1, 1, 1, 1, 2, 'سمي عصر الدولة القديمة بعصر بناه األهرامات؟', 0, '2024-12-24 08:57:46', '2024-12-24 11:30:11'),
(37, 1, 1, 1, 1, 2, 'عرف المصريون القدماء شكل الهرم الكامل في عهد سنفرو خوفو', 0, '2024-12-24 08:58:16', '2024-12-24 11:30:11'),
(38, 1, 1, 1, 1, 2, 'أشهر المعارك التي قادها الملك رمسيس الثاني هي معركة قادش؟', 0, '2024-12-24 08:58:32', '2024-12-24 11:30:11'),
(39, 1, 1, 1, 1, 2, 'كان الملك سنفرو ملكاً محبوباً لدي المصريين؟', 0, '2024-12-24 08:59:03', '2024-12-24 11:30:11'),
(40, 1, 1, 1, 1, 2, 'ازدهرت التجارة الخارجية لمصر في عهد الملك خوفو خاصةمع السودان فينيقيا؟', 0, '2024-12-24 08:59:39', '2024-12-24 11:30:11'),
(41, 1, 1, 1, 1, 2, 'يعتبر الملك خوفو صاحب الهرم الاوسط خفرع؟', 0, '2024-12-24 09:06:32', '2024-12-24 11:30:11'),
(42, 1, 1, 1, 1, 2, 'ازداد نفوذ الكهنة اإللة آمون مع نهاية األسرة الـ 4 ؟', 0, '2024-12-24 09:18:27', '2024-12-24 11:30:11'),
(43, 1, 1, 1, 1, 2, 'يعتبر الملك أوناس أول من كتب متون األهرام', 0, '2024-12-24 09:18:42', '2024-12-24 11:30:11'),
(44, 1, 1, 1, 1, 2, 'اتسم عصر الدولة الوسطي بمصر القديمة بإستقرار الحكم', 0, '2024-12-24 09:18:58', '2024-12-24 11:30:11'),
(45, 1, 1, 1, 1, 2, 'استطاع الملك أحمس االنتصار علي ملوك أهناسيا في الشمال م نت و حتب الثاني؟', 0, '2024-12-24 09:19:31', '2024-12-24 11:30:11'),
(46, 1, 1, 1, 1, 2, 'نجح الملك أمنمحات االول في طرد القبائل اآلسيوية التي دخلت مصر؟', 0, '2024-12-24 09:19:46', '2024-12-24 11:30:11'),
(47, 1, 1, 1, 1, 2, 'ساهمت قناه سيزوستريس في تنشيط حركة التجارة بمصر؟', 0, '2024-12-24 09:20:07', '2024-12-24 11:30:11'),
(48, 1, 1, 1, 1, 2, 'اهتم الملوك الملك امنمحات االول ب إنشاء السدود وقام بإنشاء سد الالهون أمنمحات الثالث؟', 0, '2024-12-24 09:20:28', '2024-12-24 11:30:11'),
(49, 1, 1, 1, 1, 2, 'اقتصر اهتمام الملك أحمس علي الكفاح المسلح ضد األعداء البناء والتعمير', 0, '2024-12-24 09:20:38', '2024-12-24 11:30:11'),
(50, 1, 1, 1, 1, 2, 'استطاع الملك زوسر الوصول إلي نهر الفرات تحتمس األول', 0, '2024-12-24 09:20:48', '2024-12-24 11:30:11'),
(51, 1, 1, 1, 1, 2, 'نجح الملك أمنمحات االول في االنتصار علي ملوك أهناسيا في الشمال م نت و حتب الثانيظ', 0, '2024-12-24 09:21:12', '2024-12-24 11:30:11'),
(52, 1, 1, 1, 1, 2, 'اقتصر إنشاء المسالت الضخمة علي عصر الدولة القديمة لم تقتصر؟', 0, '2024-12-24 09:21:20', '2024-12-24 11:30:11'),
(53, 1, 1, 1, 1, 2, 'انتهي عصر الدولة الحديثة بدخول اإلسكندر األكبر إلي مصر العصر المتأخر', 0, '2024-12-24 09:21:36', '2024-12-24 11:30:11'),
(54, 1, 1, 1, 1, 2, 'ترجع شهرة الملك توت عنخ آمون ألك تشاف مقبرته عام 1922م؟', 0, '2024-12-24 09:21:54', '2024-12-24 11:30:11'),
(55, 1, 1, 1, 1, 2, 'يعد فصل الصيف هو فصل النمو الحقيقي ألشجار غابات البحر المتوسط الشتاء؟', 0, '2024-12-24 09:28:38', '2024-12-24 11:30:11'),
(56, 1, 1, 1, 1, 2, 'تختلف مساحات النظم البيئية في العالم', 0, '2024-12-24 09:29:09', '2024-12-24 11:30:11'),
(57, 1, 1, 1, 1, 2, 'يوجد بقارة أفريقا نظم أرضية متنوعة؟', 0, '2024-12-24 09:29:36', '2024-12-24 11:30:11'),
(58, 1, 1, 1, 1, 2, 'غابات حوض نهر الكونغو دوراً في إعادة التوازن البيئي ؟', 0, '2024-12-24 09:29:59', '2024-12-24 11:30:11'),
(59, 1, 1, 1, 1, 2, 'تعد قارة أفريقيا أكثر القارات تأثراً باتغيرات المناخية ؟', 0, '2024-12-24 09:30:27', '2024-12-24 11:30:11'),
(60, 1, 1, 1, 1, 2, 'تتعرض أنواع كثيرة من الحيوانات لألنقراض بسبب التوسع العمراني', 0, '2024-12-24 09:30:39', '2024-12-24 11:30:11'),
(61, 1, 1, 1, 1, 3, 'بما تفسر اهتمام الملوك العصر العتيق بالطرق الصحراوية؟', 0, '2024-12-24 09:33:27', '2024-12-24 11:30:33'),
(62, 1, 1, 1, 1, 3, 'بما تفسر اهتمام المصري القديم بنحت التماثيل الملكية؟', 0, '2024-12-24 09:34:12', '2024-12-24 11:30:33'),
(63, 1, 1, 1, 1, 3, 'بما تفسر قيام الملك أوناس بكتابة نصوص الاهرام علي جدران حجرة الدفن داخل الهرم؟', 0, '2024-12-24 09:35:12', '2024-12-24 11:30:33'),
(64, 1, 1, 1, 1, 3, 'بما تفسر تسمية الملك سنفرو بالملك المحسن المحبوب؟', 0, '2024-12-24 09:36:22', '2024-12-24 11:30:33'),
(65, 1, 1, 1, 1, 3, 'بما تفسر تعد فترة حكم الملك منتوحتب الثاني بداية لمجد الاسرة الـحادية عشر ؟', 0, '2024-12-24 09:37:11', '2024-12-24 11:30:33'),
(66, 1, 1, 1, 1, 3, 'بما تفسر قيام الملك أمنمحات األول بنقل العاصمة إلي إثيت تاوي؟', 0, '2024-12-24 09:37:41', '2024-12-24 11:30:33'),
(67, 1, 1, 1, 1, 3, 'بما تفسر قيام الملك سنوسرت الثالث بحفر قناه سيزوستريس؟', 0, '2024-12-24 09:38:51', '2024-12-24 11:30:33'),
(68, 1, 1, 1, 1, 3, 'بما تفسر قيام الملك كامس بالقيام بحملة مفاجئة عل ي أرض كوش؟', 0, '2024-12-24 09:39:48', '2024-12-24 11:30:33'),
(69, 1, 1, 1, 1, 3, 'بما تفسر اهتمام الملك تحتمس األول بتطوير معبد الكرنك؟', 0, '2024-12-24 09:40:54', '2024-12-24 11:30:33'),
(70, 1, 1, 1, 1, 3, 'بما تفسر إتباع الملك تحتمس الثالث سياسات سلمية مع أمراء آسيا ؟', 0, '2024-12-24 09:41:44', '2024-12-24 11:30:33'),
(71, 1, 1, 1, 1, 3, 'بما تفسر تسمية عصر رمسيس الثاني بعصر اإلمبراطورية الثانية؟', 0, '2024-12-24 09:59:01', '2024-12-24 11:30:33'),
(72, 1, 1, 1, 1, 3, 'بما تفسر يعتبرالملك رمسيس الثالث المؤسس الحقيقي للاسرة الــعشرون؟', 0, '2024-12-24 09:59:54', '2024-12-24 11:30:33'),
(73, 1, 1, 1, 1, 3, 'بما تفسر ازدياد النشاط التجاري بين مصر وأفريقيا خلال عصر الدولة الحديثة؟', 0, '2024-12-24 10:01:06', '2024-12-24 11:30:33'),
(74, 1, 1, 1, 1, 3, 'بما تفسر سقوط الاسرة الــرابعة والعشرون ؟', 0, '2024-12-24 10:02:01', '2024-12-24 11:30:33'),
(75, 1, 1, 1, 1, 3, 'بما تفسرتتميز تربة الغابات المطيرة باللون الاحمر؟', 0, '2024-12-24 10:03:41', '2024-12-24 11:30:33'),
(76, 1, 1, 1, 1, 3, 'بما تفسر كثرة النباتات المتسلقة والطفيلية في نظم الغابات المدارية المطيرة؟', 0, '2024-12-24 10:04:25', '2024-12-24 11:30:33'),
(77, 1, 1, 1, 1, 3, 'بما تفسر الاهمية البيئية لغابات البحر المتوسط؟', 0, '2024-12-24 10:05:04', '2024-12-24 11:30:33'),
(78, 1, 1, 1, 1, 3, 'بما تفسر إزالة الغابات في قارة أفريقيا ؟', 0, '2024-12-24 10:14:29', '2024-12-24 11:30:33'),
(79, 1, 1, 1, 1, 3, 'بما تفسرأشجار غابات البحر المتوسط دائمة الخضرة طوال العام ؟', 0, '2024-12-24 10:15:20', '2024-12-24 11:30:33'),
(80, 1, 1, 1, 1, 3, 'بما تفسر ضعف ونهاية ا لدولة الحديثة؟', 0, '2024-12-24 10:20:02', '2024-12-24 11:30:33'),
(81, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على زيادة نفوذ كهنة الاله رع في اواخر عصر الاسرة الرابعة ؟', 0, '2024-12-24 10:21:46', '2024-12-24 11:29:11'),
(82, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على   وصول اسرة أوسركاف إلي الحكم ؟', 0, '2024-12-24 10:28:10', '2024-12-24 11:29:11'),
(83, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على   قيام المصريين بثورة عارمة في نهاية عصر الدولة القديمة؟', 0, '2024-12-24 10:31:15', '2024-12-24 11:29:11'),
(84, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على حالة الضعف التي امتدت من الاسرة الـ 7 حتي الاسرة 10 ؟', 0, '2024-12-24 10:31:57', '2024-12-24 11:29:11'),
(85, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على قيام الملك سنوسرت الثالث بحفر قناة سيزوستريس؟', 0, '2024-12-24 10:32:54', '2024-12-24 11:29:11'),
(86, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على  وصول الملكة سبك نفرو إلي حكم البلاد؟', 0, '2024-12-24 10:33:22', '2024-12-24 11:29:11'),
(87, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على  ضعف الملوك بعدأمنمحات الثالث؟', 0, '2024-12-24 10:34:02', '2024-12-24 11:29:11'),
(88, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على  أعمال الملك كامس العسكرية ضد الهكسوس ؟', 0, '2024-12-24 10:34:27', '2024-12-24 11:29:11'),
(89, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على إرسال الملك تحتمس الثالث حملته الـ 17 علي بلاد كوش؟', 0, '2024-12-24 10:35:29', '2024-12-24 11:29:11'),
(90, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على  تولي الملك توت عنخ آمون الحكم خلفاً للملك إخناتون؟', 0, '2024-12-24 10:36:42', '2024-12-24 11:29:11'),
(91, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على هزيمة الحيثيين علي يد الملك رمسيس الثاني؟', 0, '2024-12-24 10:37:16', '2024-12-24 11:29:11'),
(92, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على    الصراع بين المصريين والكوشيين في عصر األسرة الـ .14 ؟', 0, '2024-12-24 10:37:53', '2024-12-24 11:29:11'),
(93, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على تعرض قارة أفريقيا للتغيرات المناخية ؟', 0, '2024-12-24 10:39:25', '2024-12-24 11:29:11'),
(94, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على     قطع أشجار الغابات في قارة أفريقيا ؟', 0, '2024-12-24 10:40:04', '2024-12-24 11:29:11'),
(95, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على تعرض غابات البحر المتوسط لقلة سقوط الامطار في بعض السنوات ؟', 0, '2024-12-24 10:40:35', '2024-12-24 11:29:11'),
(96, 1, 1, 1, 1, 4, 'ماهى النتائج المترتبة على حاجة الملك سنفرو إلي الاخشاب ؟', 0, '2024-12-24 11:50:28', '2024-12-24 11:29:11'),
(97, 1, 1, 1, 1, 0, 'اعتقد الفنان المصري القديم في قدسية الملوك.؟', 0, '2024-12-24 12:01:16', '2024-12-24 11:27:59');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
